app/controllers/infos_controller.rb

SELECT * FROM "infos"
---
  def index
    @infos = Info.all

SELECT * FROM "infos" WHERE ("infos"."id" = 1)
---
  def show
    @info = Info.find(params[:id])

INSERT INTO "infos" ("created_at", "title", "body", "updated_at") VALUES('2009-09-01 02:59:33', 'Aaa', 'This is A.', '2009-09-01 02:59:33')
---
  def create
    @info = Info.new(params[:info])
    if @info.save