app/controllers/users_controller.rb

  def new
    @user = User.new
    @allowed_plans = SubscriptionPlan.all(:order => :rate_cents)
---
SELECT * FROM "subscription_plans" WHERE ("subscription_plans"."rate_cents" = 0) LIMIT 1

  def create
    #debugger
    @user = User.new(params[:user])
    if @user.save
      flash[:notice] = "Thank you for signing up! You are now logged in."
      redirect_to root_url
    else
      @allowed_plans = SubscriptionPlan.all(:order => :rate_cents)
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2009-09-01 02:59:15', 'dede1fa957767a44a2c19142969819566dbd001619ccaee00bd2fb941d361cbd9c8ac16a8e36e1d26403dcb567264d3e6cc24d2186abfded9a8e55f90f868980', '2009-09-01 02:59:15', 'jonathan', 'Nlt0RPqNilWutJrOTS8_', '92d2e4a94f9579dadbdb9ee12096118d75370bd20f0d43986fc5797eec9a24520d3e3513dde86beac8d9d771a478b971d6a717bbdb1da8a3b1aad2da4ed0c6cc', 'jonathan@linowes.com')
SELECT * FROM "subscription_plans" ORDER BY rate_cents

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2009-09-01 17:17:06', "email" = 'changed@example.com' WHERE "id" = 1